{
  "architectures": [
    "CamembertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 5,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 6,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-DRUG",
    "2": "I-DRUG",
    "3": "B-BRAND",
    "4": "I-BRAND",
    "5": "B-MANUFACTURER",
    "6": "I-MANUFACTURER",
    "7": "B-FORM",
    "8": "I-FORM",
    "9": "B-STRENGTH",
    "10": "I-STRENGTH"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-BRAND": 3,
    "B-DRUG": 1,
    "B-FORM": 7,
    "B-MANUFACTURER": 5,
    "B-STRENGTH": 9,
    "I-BRAND": 4,
    "I-DRUG": 2,
    "I-FORM": 8,
    "I-MANUFACTURER": 6,
    "I-STRENGTH": 10,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "camembert",
  "num_attention_head": 12,
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.6",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 25005
}
